In [22]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [23]:
df = pd.read_csv('PricingData - PricingData.csv')

In [24]:
df.head()

,Seat Fare Type 1,Seat Fare Type 2,Bus,Service Date,RecordedAt
0,"900.00,800.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,11-07-2020 16:28
1,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,11-07-2020 19:17
2,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,12-07-2020 09:02
3,"910.00,833.00,795.00,762.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,12-07-2020 10:05
4,"876.00,800.00,767.00,729.00",NaN,d6fa79179fda2a77455794637f225962,15-07-2020 00:00,13-07-2020 01:53

In [25]:
# df['Service Date'] = df['Service Date'].to_datetime
df['Service Date'] =  pd.to_datetime(df['Service Date'] ,)

In [26]:
df['RecordedAt'] = pd.to_datetime(df['RecordedAt'])

In [27]:
df['Seat Fare Type 1'] = df['Seat Fare Type 1'].astype('string')
df['Seat Fare Type 2'] = df['Seat Fare Type 2'].astype('string')
df['Bus'] = df['Bus'].astype('string')

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30649 entries, 0 to 30648
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Seat Fare Type 1  17785 non-null  string
 1   Seat Fare Type 2  12746 non-null  string
 2   Bus               30649 non-null  string
 3   Service Date      30649 non-null  datetime64[ns]
 4   RecordedAt        30649 non-null  datetime64[ns]
dtypes: datetime64[ns](2), string(3)
memory usage: 1.2 MB

In [29]:
df['service day'] = df['Service Date'].dt.day
df['recorded day'] = df['RecordedAt'].dt.day
df['recorded hrs'] = df['RecordedAt'].dt.hour
df['recorded min'] = df['RecordedAt'].dt.minute

In [30]:
df.drop(columns=['Service Date','RecordedAt'])

,Seat Fare Type 1,Seat Fare Type 2,Bus,service day,recorded day,recorded hrs,recorded min
0,"900.00,800.00",<NA>,d6fa79179fda2a77455794637f225962,15,7,16,28
1,"910.00,833.00,795.00,762.00",<NA>,d6fa79179fda2a77455794637f225962,15,7,19,17
2,"910.00,833.00,795.00,762.00",<NA>,d6fa79179fda2a77455794637f225962,15,7,9,2
3,"910.00,833.00,795.00,762.00",<NA>,d6fa79179fda2a77455794637f225962,15,7,10,5
4,"876.00,800.00,767.00,729.00",<NA>,d6fa79179fda2a77455794637f225962,15,13,1,53
...,...,...,...,...,...,...,...
30644,"925.00,810.00",<NA>,6ebe14c775a983e43b07c55e6b71d77d,30,30,7,59
30645,"925.00,810.00",<NA>,6ebe14c775a983e43b07c55e6b71d77d,30,30,7,59
30646,"925.00,810.00",<NA>,6ebe14c775a983e43b07c55e6b71d77d,30,30,8,8
30647,"925.00,810.00",<NA>,6ebe14c775a983e43b07c55e6b71d77d,30,30,8,21
30648,"925.00,810.00",<NA>,6ebe14c775a983e43b07c55e6b71d77d,30,30,8,21

In [36]:
print(f'total lenght of data {len(df)}')
print(f'total unique buses {len(df.Bus.unique())}')

total lenght of data 30649
total unique buses 117

In [ ]:
#  IS COLUMN TWO OF SEAT FARE TYPE 2 USEFUL ENOUGH ??